/**
******************************************************************************
* @file    wwdg.c  
* @brief   配置窗口看门狗
*          
******************************************************************************
*/
/* Includes ------------------------------------------------------------------*/
#include "HAL_device.h"
/********************************************************************************************************
**函数信息 ：void WWDG_IRQHandler (void)                   
**功能描述 ：窗口看门狗中断函数
**输入参数 ：无
**输出参数 ：无
**    备注 ：当递减计数器等于0x40时进入中断
计数器参数须小于0x7f大于0x40,若接近于0x40可能会频繁进入此中断           
********************************************************************************************************/
void WWDG_IRQHandler (void)
{	
    if((WWDG->SR))
    {
        WWDG->SR = (uint32_t)RESET;
        WWDG->CR = (0x66&0x7f);                                                                             
    }
}

/********************************************************************************************************
**函数信息 ：Wwdg_reset_test()                     
**功能描述 ：使用窗口看门狗
**输入参数 ：unsigned char ucTcn 看门狗递减计数器值
unsigned char ucWcnt窗口值
**输出参数 ：无
**    备注 ：系统启动时看门狗为失能状态,看门狗失能后不能手动关闭,复位后看门狗失能 
WWDG_SetCounter(0x7e);喂狗函数
WWDG_Enable(0x7e);看门狗使能并赋值计数器
窗口看门狗复位时间为微秒到毫秒级,适用短时间等待复位
WWDG counter clock = (PCLK1/4096)/x 
********************************************************************************************************/
void Wwdg_reset_ON(unsigned char ucTcnt,unsigned char ucWcnt)
{
    /*窗口看门狗时钟*/
    RCC->APB1ENR|=0x00000800; 
    
    /*WWDG_Prescaler_x,x为1,2,4,8,WWDG counter clock = (PCLK1/4096)/x */
    WWDG->CFR = 0x00000180;
    WWDG->CFR = ucWcnt;
    /*为看门狗自减计数器赋值,为7位数据且数值为0x40~0x7f之间*/
    WWDG->CR = 0x00000080 | ucTcnt;
}


