#include "delay.h"
#include "sys.h"
#include "led.h"
#include "uart_loop.h"
/********************************************************************************************************
**函数信息 ：int main (void)                          
**功能描述 ：开机后，ARMLED闪动
**输入参数 ：
**输出参数 ：
********************************************************************************************************/

int main(void)
{
    
    LED_Init();		  	 	//初始化与LED连接的硬件接口
    UartInit_Loop();  //UART1的发送，可以通过串口软件打印UART OK
    while(1)              //无限循环
    {
        Uart1RxTest(UART1);//UART1的接收，在串口软件中输入字符，可以通过打印验证接收的数据是否正确
    }
}



